export const textColor: { [k: string]: string } = {
  // H帯
  発展現代文: "#85acf1",
  標準現代文: "#85acf1",
  実践英会話: "#85acf1",
  // I帯
  発展古典: "#c9daf8",
  標準古典: "#c9daf8",
  体育概論: "#c9daf8",
  基礎英語: "#c9daf8",
  // HI帯
  数学Ⅲ: "#c9daf8",
  数学演習: "#c9daf8",
  // J帯
  数学IA演習: "#d9d2e9",
  受験家庭: "#d9d2e9",
  // K帯
  実用国語: "#cbbaf1",
  数学ⅡB演習: "#cbbaf1",
  音楽理論: "#cbbaf1",
  芸術美術: "#cbbaf1",
  // JK帯
  受験日本史: "#d9d2e9",
  受験世界史: "#d9d2e9",
  受験政経: "#d9d2e9",
  物理演習: "#d9d2e9",
  化学演習: "#d9d2e9",
  生物演習: "#d9d2e9",
  物理: "#d9d2e9",
  化学: "#d9d2e9",
  生物: "#d9d2e9",
  // L帯
  日本史: "#f7c18a",
  英語長文: "#f7c18a",
  受験英語: "#f7c18a",
  英文講読: "#f7c18a",
  // その他
  LHR: "#fff2cc",
  総合: "#fff2cc",
  武ダ: "#fff2cc",
  現社: "#d9ead3",
  英語: "#fce5cd",
  体育: "#ead1dc",
  国語: "#f4cccc",
};

export const levelOptions: SelectValue[] = [
  { label: "基礎１", value: 1 },
  { label: "基礎２", value: 2 },
  { label: "基礎３", value: 3 },
  { label: "基礎４", value: 4 },
  { label: "基礎５", value: 5 },
  { label: "基礎７", value: 7 },
  { label: "基礎１０", value: 10 },
  { label: "基礎１３", value: 13 },
];

export const lineHOptions: SelectValue[] = [
  { label: "発展現代文", value: "発展現代文" },
  { label: "標準現代文", value: "標準現代文" },
  { label: "実践英会話", value: "実践英会話" },
  { label: "数学Ⅲ", value: "数学Ⅲ" },
  { label: "数学演習", value: "数学演習" },
];

export const lineIOptions: SelectValue[] = [
  { label: "発展古典", value: "発展古典" },
  { label: "標準古典", value: "標準古典" },
  { label: "体育概論", value: "体育概論" },
  { label: "基礎英語", value: "基礎英語" },
  { label: "数学Ⅲ", value: "数学Ⅲ" },
  { label: "数学演習", value: "数学演習" },
];

export const lineJOptions: SelectValue[] = [
  { label: "数学IA演習", value: "数学IA演習" },
  { label: "受験家庭", value: "受験家庭" },
  { label: "受験日本史", value: "受験日本史" },
  { label: "受験世界史", value: "受験世界史" },
  { label: "受験政経", value: "受験政経" },
  { label: "物理演習", value: "物理演習" },
  { label: "化学演習", value: "化学演習" },
  { label: "生物演習", value: "生物演習" },
  { label: "物理", value: "物理" },
  { label: "化学", value: "化学" },
  { label: "生物", value: "生物" },
];

export const lineKOptions: SelectValue[] = [
  { label: "実用国語", value: "実用国語" },
  { label: "数学ⅡB演習", value: "数学ⅡB演習" },
  { label: "音楽理論", value: "音楽理論" },
  { label: "芸術美術", value: "芸術美術" },
  { label: "受験日本史", value: "受験日本史" },
  { label: "受験世界史", value: "受験世界史" },
  { label: "受験政経", value: "受験政経" },
  { label: "物理演習", value: "物理演習" },
  { label: "化学演習", value: "化学演習" },
  { label: "生物演習", value: "生物演習" },
  { label: "物理", value: "物理" },
  { label: "化学", value: "化学" },
  { label: "生物", value: "生物" },
];

export const lineLOptions: SelectValue[] = [
  { label: "日本史", value: "日本史" },
  { label: "英語長文", value: "英語長文" },
  { label: "受験英語", value: "受験英語" },
  { label: "英文講読", value: "英文講読" },
];

export const holders = {
  1: [
    ["", "月", "火", "水", "木", "金"],
    ["1", "LHR", "l", "体育", "h", "l"],
    ["2", "現社", "体育", "英語", "英語", "武ダ"],
    ["3", "英語", "k", "k", "現社", "英語"],
    ["4", "i", "i", "j", "k", "国語"],
    ["5", "j", "英語", "国語", "l", "j"],
    ["6", "h", "国語", "i", "総合", "h"],
  ],
  2: [
    ["", "月", "火", "水", "木", "金"],
    ["1", "LHR", "l", "体育", "h", "l"],
    ["2", "国語", "体育", "現社", "現社", "武ダ"],
    ["3", "英語", "k", "k", "英語", "国語"],
    ["4", "i", "i", "j", "k", "英語"],
    ["5", "j", "英語", "英語", "l", "j"],
    ["6", "h", "国語", "i", "総合", "h"],
  ],
  3: [
    ["", "月", "火", "水", "木", "金"],
    ["1", "LHR", "l", "体育", "h", "l"],
    ["2", "英語", "体育", "英語", "英語", "武ダ"],
    ["3", "現社", "k", "k", "国語", "英語"],
    ["4", "i", "i", "j", "k", "国語"],
    ["5", "j", "現社", "国語", "l", "j"],
    ["6", "h", "英語", "i", "総合", "h"],
  ],
  4: [
    ["", "月", "火", "水", "木", "金"],
    ["1", "LHR", "l", "体育", "h", "l"],
    ["2", "英語", "体育", "国語", "現社", "武ダ"],
    ["3", "国語", "k", "k", "英語", "現社"],
    ["4", "i", "i", "j", "k", "英語"],
    ["5", "j", "国語", "英語", "l", "j"],
    ["6", "h", "英語", "i", "総合", "h"],
  ],
  5: [
    ["", "月", "火", "水", "木", "金"],
    ["1", "LHR", "l", "英語", "h", "l"],
    ["2", "現社", "英語", "現社", "武ダ", "体育"],
    ["3", "英語", "k", "k", "英語", "国語"],
    ["4", "i", "i", "j", "k", "英語"],
    ["5", "j", "国語", "国語", "l", "j"],
    ["6", "h", "体育", "i", "総合", "h"],
  ],
  7: [
    ["", "月", "火", "水", "木", "金"],
    ["1", "LHR", "l", "英語", "h", "l"],
    ["2", "武ダ", "英語", "体育", "国語", "国語"],
    ["3", "英語", "k", "k", "英語", "現社"],
    ["4", "i", "i", "j", "k", "英語"],
    ["5", "j", "体育", "現社", "l", "j"],
    ["6", "h", "国語", "i", "総合", "h"],
  ],
  10: [
    ["", "月", "火", "水", "木", "金"],
    ["1", "LHR", "l", "国語", "h", "l"],
    ["2", "英語", "現社", "英語", "英語", "英語"],
    ["3", "国語", "k", "k", "武ダ", "体育"],
    ["4", "i", "i", "j", "k", "現社"],
    ["5", "j", "英語", "体育", "l", "j"],
    ["6", "h", "国語", "i", "総合", "h"],
  ],
  13: [
    ["", "月", "火", "水", "木", "金"],
    ["1", "LHR", "l", "現社", "h", "l"],
    ["2", "英語", "国語", "英語", "英語", "英語"],
    ["3", "体育", "k", "k", "現社", "国語"],
    ["4", "i", "i", "j", "k", "体育"],
    ["5", "j", "英語", "国語", "l", "j"],
    ["6", "h", "武ダ", "i", "総合", "h"],
  ],
};
